本节将展示如何使用Python3与MySQL来进行数据库管理。

In [1]:
import pandas as pd
import numpy as np
# 引入MySQLdb来在Python中调用mysql。
import MySQLdb

# 链接到本地数据库
db = MySQLdb.connect(host="localhost", user="root" , passwd="xz2102")
# 若提示"Can't connect to MySQL server on 'localhost' (10061)"， 则说明本地 Mysql 服务未打开
# 打开安装目录下的 bin\mysqld ， 随后到Task Manager -> Services -> MySQL 右键启动即可

# 查看本地数据库
print(db)

<_mysql.connection open to 'localhost' at 5f264908>

### Create a new database

In [2]:
mycursor = db.cursor()

# Create a new database with name as 'mydatabases'.
mycursor.execute("CREATE DATABASE mydatabase")

# You can check if a database exist by listing all databases in your system by using the "SHOW DATABASES" statement:
mycursor.execute("SHOW DATABASES")

for x in mycursor:
    print(x)
    
# Or you can try to access the database when making the connection:
'''
db = MySQLdb.connect(
  host="localhost",
  user="yourusername",
  passwd="yourpassword",
  database="mydatabase"
)
'''

('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('test',)
('xztest',)

'\ndb = MySQLdb.connect(\n  host="localhost",\n  user="yourusername",\n  passwd="yourpassword",\n  database="mydatabase"\n)\n'

In [3]:
# enter one database:
mycursor.execute("Use mydatabase;")

# To create a table in MySQL, use the "CREATE TABLE" statement.
mycursor.execute("CREATE TABLE customers (name VARCHAR(255), address VARCHAR(255))")

#You can check if a table exist by listing all tables in your database with the "SHOW TABLES" statement:
mycursor.execute("SHOW TABLES")

for x in mycursor:
    print(x)

('customers',)

### Create a new table
When creating a table, you should also create a column with a unique key for each record.

This can be done by defining a PRIMARY KEY.

We use the statement "INT AUTO_INCREMENT PRIMARY KEY" which will insert a unique number for each record. Starting at 1, and increased by one for each record.

In [4]:
# mycursor.execute("CREATE TABLE customers (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), address VARCHAR(255))")

# If the table already exists, use the ALTER TABLE keyword:
mycursor.execute("ALTER TABLE customers ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

0

### Insert Into Table

To fill a table in MySQL, use the "INSERT INTO" statement.

Notice the statement: db.commit(). It is required to make the changes, otherwise no changes are made to the table.

In [5]:
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = ("John", "Highway 21")
mycursor.execute(sql, val)

db.commit()

print(mycursor.rowcount, "record inserted.")

1 record inserted.

### Insert Multiple Rows

To insert multiple rows into a table, use the executemany() method.

The second parameter of the executemany() method is a list of tuples, containing the data you want to insert:

In [6]:
val = [
  ('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633')
]

mycursor.executemany(sql, val)

db.commit()

print(mycursor.rowcount, "was inserted.")

13 was inserted.

Get Inserted ID
You can get the id of the row you just inserted by asking the cursor object.

Note: If you insert more that one row, the id of the last inserted row is returned.

In [7]:
val = ("Michelle", "Blue Village")
mycursor.execute(sql, val)

db.commit()

print("1 record inserted, ID:", mycursor.lastrowid)

1 record inserted, ID: 15

### Select From a Table

To select from a table in MySQL, use the "SELECT" statement:

Note: We use the fetchall() method, which fetches all rows from the last executed statement.

In [8]:
mycursor.execute("SELECT * FROM customers")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John', 'Highway 21', 1)
('Peter', 'Lowstreet 4', 2)
('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Valley 345', 5)
('Sandy', 'Ocean blvd 2', 6)
('Betty', 'Green Grass 1', 7)
('Richard', 'Sky st 331', 8)
('Susan', 'One way 98', 9)
('Vicky', 'Yellow Garden 2', 10)
('Ben', 'Park Lane 38', 11)
('William', 'Central st 954', 12)
('Chuck', 'Main Road 989', 13)
('Viola', 'Sideway 1633', 14)
('Michelle', 'Blue Village', 15)

### Selecting Columns

To select only some of the columns in a table, use the "SELECT" statement followed by the column name(s):

In [9]:
mycursor.execute("SELECT name, address FROM customers")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John', 'Highway 21')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')
('Michelle', 'Blue Village')

### Using the fetchone() Method
If you are only interested in one row, you can use the fetchone() method.

The fetchone() method will return the first row of the result:

In [10]:
mycursor.execute("SELECT * FROM customers")

myresult = mycursor.fetchone()

print(myresult)

('John', 'Highway 21', 1)

### Select With a Filter
When selecting records from a table, you can filter the selection by using the "WHERE" statement:

In [11]:
sql = "SELECT * FROM customers WHERE address ='Park Lane 38'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Ben', 'Park Lane 38', 11)

### Wildcard Characters
You can also select the records that starts, includes, or ends with a given letter or phrase.

Use the %  to represent wildcard characters:

In [12]:
sql = "SELECT * FROM customers WHERE address LIKE '%way%'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John', 'Highway 21', 1)
('Susan', 'One way 98', 9)
('Viola', 'Sideway 1633', 14)

### Prevent SQL Injection
When query values are provided by the user, you should escape the values.

This is to prevent SQL injections, which is a common web hacking technique to destroy or misuse your database.

The mysql.connector module has methods to escape query values:

In [13]:
sql = "SELECT * FROM customers WHERE address = %s"
adr = ("Yellow Garden 2", )

mycursor.execute(sql, adr)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Vicky', 'Yellow Garden 2', 10)

### Update Table
You can update existing records in a table by using the "UPDATE" statement:

In [14]:
sql = "UPDATE customers SET address = %s WHERE address = %s"
val = ("Valley 345", "Canyon 123")

mycursor.execute(sql, val)

db.commit()

print(mycursor.rowcount, "record(s) affected")

0 record(s) affected

### Limit the Result
You can limit the number of records returned from the query, by using the "LIMIT" statement:

In [15]:
mycursor.execute("SELECT * FROM customers LIMIT 5")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John', 'Highway 21', 1)
('Peter', 'Lowstreet 4', 2)
('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Valley 345', 5)

### Start From Another Position
If you want to return five records, starting from the third record, you can use the "OFFSET" keyword:

In [16]:
mycursor.execute("SELECT * FROM customers LIMIT 5 OFFSET 2")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Valley 345', 5)
('Sandy', 'Ocean blvd 2', 6)
('Betty', 'Green Grass 1', 7)

### Join Two or More Tables
You can combine rows from two or more tables, based on a related column between them, by using a JOIN statement.

Consider you have a "users" table and a "products" table:

Note: You can use JOIN instead of INNER JOIN. They will both give you the same result.

#### Users
{ id: 1, name: 'John', fav: 154},
{ id: 2, name: 'Peter', fav: 154},
{ id: 3, name: 'Amy', fav: 155},
{ id: 4, name: 'Hannah', fav:},
{ id: 5, name: 'Michael', fav:}
#### Products
{ id: 154, name: 'Chocolate Heaven' },
{ id: 155, name: 'Tasty Lemons' },
{ id: 156, name: 'Vanilla Dreams' }

In [17]:
# Create table User
mycursor.execute("Create table users (id int, name varchar(225),fav int);")
sql = "INSERT INTO users (id, name, fav) VALUES (%s, %s, %s)"
val = [ (1, 'John', 154),
        (2, 'Peter', 154),
        (3, 'Amy', 155)]
mycursor.executemany(sql,val)
db.commit()

sql = "INSERT INTO users (id, name) VALUES (%s, %s)"
val = [(4, 'Hannah'),
        (5, 'Michael')]
mycursor.executemany(sql,val)
db.commit()

# Create table products
mycursor.execute("Create table products (id int, name varchar(225));")
sql = "INSERT INTO products (id, name) VALUES (%s, %s)"
val = [ (154, 'Chocolate Heaven'),
        (156, 'Vanilla Dreams'),
        (155, 'Tasty Lemons')] 
mycursor.executemany(sql,val)
db.commit()

sql = "SELECT \
  users.name AS user, \
  products.name AS favorite \
  FROM users \
  INNER JOIN products ON users.fav = products.id"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John', 'Chocolate Heaven')
('Peter', 'Chocolate Heaven')
('Amy', 'Tasty Lemons')

#### LEFT JOIN
In the example above, Hannah, and Michael were excluded from the result, that is because INNER JOIN only shows the records where there is a match.

If you want to show all users, even if they do not have a favorite product, use the LEFT JOIN statement:

In [18]:
sql = "SELECT \
  users.name AS user, \
  products.name AS favorite \
  FROM users \
  LEFT JOIN products ON users.fav = products.id"

mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John', 'Chocolate Heaven')
('Peter', 'Chocolate Heaven')
('Amy', 'Tasty Lemons')
('Hannah', None)
('Michael', None)

#### RIGHT JOIN
If you want to return all products, and the users who have them as their favorite, even if no user have them as their favorite, use the RIGHT JOIN statement:

Note: Hannah and Michael, who have no favorite product, are not included in the result.

In [19]:
sql = "SELECT \
  users.name AS user, \
  products.name AS favorite \
  FROM users \
  RIGHT JOIN products ON users.fav = products.id"
mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John', 'Chocolate Heaven')
('Peter', 'Chocolate Heaven')
(None, 'Vanilla Dreams')
('Amy', 'Tasty Lemons')

### Sort the Result
Use the ORDER BY statement to sort the result in ascending or descending order.

The ORDER BY keyword sorts the result ascending by default. To sort the result in descending order, use the DESC keyword.

In [20]:
sql = "SELECT * FROM customers ORDER BY name"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Amy', 'Apple st 652', 3)
('Ben', 'Park Lane 38', 11)
('Betty', 'Green Grass 1', 7)
('Chuck', 'Main Road 989', 13)
('Hannah', 'Mountain 21', 4)
('John', 'Highway 21', 1)
('Michael', 'Valley 345', 5)
('Michelle', 'Blue Village', 15)
('Peter', 'Lowstreet 4', 2)
('Richard', 'Sky st 331', 8)
('Sandy', 'Ocean blvd 2', 6)
('Susan', 'One way 98', 9)
('Vicky', 'Yellow Garden 2', 10)
('Viola', 'Sideway 1633', 14)
('William', 'Central st 954', 12)

#### ORDER BY DESC
Use the DESC keyword to sort the result in a descending order.

In [21]:
sql = "SELECT * FROM customers ORDER BY name DESC"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('William', 'Central st 954', 12)
('Viola', 'Sideway 1633', 14)
('Vicky', 'Yellow Garden 2', 10)
('Susan', 'One way 98', 9)
('Sandy', 'Ocean blvd 2', 6)
('Richard', 'Sky st 331', 8)
('Peter', 'Lowstreet 4', 2)
('Michelle', 'Blue Village', 15)
('Michael', 'Valley 345', 5)
('John', 'Highway 21', 1)
('Hannah', 'Mountain 21', 4)
('Chuck', 'Main Road 989', 13)
('Betty', 'Green Grass 1', 7)
('Ben', 'Park Lane 38', 11)
('Amy', 'Apple st 652', 3)

### Delete Record
You can delete records from an existing table by using the "DELETE FROM" statement:

Important!: Notice the statement: mydb.commit(). It is required to make the changes, otherwise no changes are made to the table.

Notice the WHERE clause in the DELETE syntax: The WHERE clause specifies which record(s) that should be deleted. If you omit the WHERE clause, all records will be deleted!

In [22]:
sql = "DELETE FROM customers WHERE address = 'Mountain 21'"

mycursor.execute(sql)

db.commit()

print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

### Delete a Table
You can delete an existing table by using the "DROP TABLE" statement:

In [23]:
sql = "DROP TABLE customers"

mycursor.execute(sql)

0

### Drop Only if Exist
If the the table you want to delete is already deleted, or for any other reason does not exist, you can use the IF EXISTS keyword to avoid getting an error.

In [24]:
sql = "DROP TABLE IF EXISTS customers"

mycursor.execute(sql)

d:\python\lib\site-packages\ipykernel_launcher.py:3: Warning: (1051, "Unknown table 'customers'")
  This is separate from the ipykernel package so we can avoid doing imports until

0

In [25]:
# drop mydatabase after this script.
mycursor.execute('DROP DATABASE IF EXISTS mydatabase;')

2

In [26]:
# disconnect python with mysql
db.close()

Reference: https://www.w3schools.com/python/python_mysql_getstarted.asp